questionsData_IEJP = [
    {
        id: 1,
        text: "在一個新的社交場合中，你更傾向...",
        options: [
            { text: "主動向陌生人介紹自己，開啟對話", value: "E" },
            { text: "等待他人主動搭話或介紹", value: "I" }
        ]
    },
    {
        id: 2,
        text: "如果你要做一件比較複雜的事（例如組裝傢俱、使用新工具），你通常...",
        options: [
            { text: "先弄清楚整體流程如何進行，再開始做（例如先看說明書）", value: "J" },
            { text: "先開始動手做，邊做邊探索，依情況調整做法", value: "P" }
        ]
    },
    {
        id: 3,
        text: "當你腦中有一些想法時，你更傾向...",
        options: [
            { text: "將想法表達出來，與他人分享", value: "E" },
            { text: "不太表達，或只對熟悉的人表達", value: "I" }
        ]
    },
    {
        id: 4,
        text: "規劃一個旅程時，你比較傾向...",
        options: [
            { text: "事先規劃好大部分的時間會做什麼、玩什麼", value: "J" },
            { text: "保留更多彈性，大部分時間看當下想玩什麼就玩什麼", value: "P" }
        ]
    },
    {
        id: 5,
        text: "在群體中...",
        options: [
            { text: "我享受眾人的關注，樂於成為注意力的焦點", value: "E" },
            { text: "若太多人注意我，會讓我感到不自在", value: "I" }
        ]
    },
    {
        id: 6,
        text: "生活中需要做一些決定時，你通常...",
        options: [
            { text: "果斷決策，設定具體目標並遵循計劃", value: "J" },
            { text: "較慢決定，傾向保留可以改變決定的空間", value: "P" }
        ]
    },
    {
        id: 7,
        text: "與他人互動時，你更傾向...",
        options: [
            { text: "花點時間思考，先想好再說", value: "I" },
            { text: "快速反應，一邊說一邊繼續理清思路", value: "E" }
        ]
    },
    {
        id: 8,
        text: "你更傾向於哪種生活方式？",
        options: [
            { text: "我喜歡一切井然有序，例如物品應有固定位置、任務應有明確分類等，這讓我覺得比較有效率", value: "J" },
            { text: "我喜歡較隨興的生活，能根據當下需求隨意安排，這讓我感到輕鬆和自由自在", value: "P" }
        ]
    },
    {
        id: 9,
        text: "你更喜歡哪種生活方式？",
        options: [
            { text: "事先將會議、社交聚集、休閒活動等事情安排妥當", value: "J" },
            { text: "無拘無束，看當時有什麼好玩就做什麼", value: "P" }
        ]
    },
    {
        id: 10,
        text: "新認識一位朋友時，你通常...",
        options: [
            { text: "可以很快和對方混熟", value: "E" },
            { text: "比較慢熟，別人覺得不太容易了解我", value: "I" }
        ]
    },
    {
        id: 11,
        text: "當你要完成一個大項目，在開始時你會...",
        options: [
            { text: "馬上動工，邊做邊看還要做什麼", value: "P" },
            { text: "把要做的小項目依序列出，再開始做", value: "J" }
        ]
    },
    {
        id: 12,
        text: "在你能掌握自己時間的情況下，你的一天通常是...",
        options: [
            { text: "按照安排好的時間表做事", value: "J" },
            { text: "隨興決定什麼時候要做什麼", value: "P" }
        ]
    },
    {
        id: 13,
        text: "哪一個更符合你的經驗？",
        options: [
            { text: "長時間和人相處會讓我感到疲憊，我需要透過獨處來恢復能量", value: "I" },
            { text: "長時間與人隔離會讓我感到難受，我需要透過與人互動來恢復活力", value: "E" }
            
        ]
    },
    {
        id: 14,
        text: "事先安排好一天的行程，並按照行程表做事...",
        options: [
            { text: "我會感到束縛，想要能有隨興變化的空間", value: "P" },
            { text: "是合我心意的，會讓我感到有秩序、有效率", value: "J" }
            
        ]
    },
    {
        id: 15,
        text: "你和人聊天時...",
        options: [
            { text: "能輕鬆而長時間與多數人交談", value: "E" },
            { text: "只對某些人或在某些情況下才能暢所欲言", value: "I" }
        ]
    },
    {
        id: 16,
        text: "在團隊討論中，你更傾向...",
        options: [
            { text: "多傾聽，低調安靜，默默觀察", value: "I" },
            { text: "多說話，表現活躍，熱情發言", value: "E" }
        ]
    },
    {
        id: 17,
        text: "你更喜歡...",
        options: [
            { text: "參與大群體活動，和許多人交流，認識新朋友", value: "E" },
            { text: "與少數幾位較親密的朋友深入交流", value: "I" }
        ]
    },
    {
        id: 18,
        text: "如果你有一個有明確截止日期的任務，你通常...",
        options: [
            { text: "及早開始，避免面對截止日期的壓力", value: "J" },
            { text: "接近截止日期再開始，通常此時會有更高的效率", value: "P" }
        ]
    }
];



questionsDataTeFe = [
    {
        id: 1,
        text: "你更傾向重視哪一個？",
        options: [
            { text: "群體的和諧與團結。這不是為了群體和諧帶來的工作效益，而是因為真正對人們產生深切的同情，並且你不喜歡群體中有人被排斥或忽視。", value: "Fe" },
            { text: "取得成果和成就。這不意味著你冷漠，而是對你來說，取得成果和找到真正解決問題的方案更重要。", value: "Te" }
        ]
    },
    {
        id: 2,
        text: "在解決人際衝突時，你更傾向...",
        options: [
            { text: "分析問題根源，嘗試找出解決問題的方案", value: "Te" },
            { text: "傾聽每個人的感受，促進相互理解以恢復和諧", value: "Fe" }
        ]
    },
    {
        id: 3,
        text: "當你需要說服別人接受一個想法時，你更傾向...",
        options: [
            { text: "提供數據和邏輯論證，證明想法的實際效益", value: "Te" },
            { text: "找到共同的價值觀，引起他人的共鳴", value: "Fe" }
        ]
    },
    {
        id: 4,
        text: "哪一個是你更有興趣的？",
        options: [
            { text: "接觸他人、理解他人，同理他人的感受", value: "Fe" },
            { text: "設計或優化系統和流程，解決問題", value: "Te" }
        ]
    },
    {
        id: 5,
        text: "在規劃或決定一件事時，你通常更傾向考慮...",
        options: [
            { text: "他人的感受和需要", value: "Fe" },
            { text: "是否高效達成目標", value: "Te" }
        ]
    },
    {
        id: 6,
        text: "你更常在乎的是...",
        options: [
            { text: "事物是否具有實用價值", value: "Te" },
            { text: "行為是否符合社會或群體的期望", value: "Fe" }
        ]
    },
    {
        id: 7,
        text: "若你想幫助一個群體更好，你傾向...",
        options: [
            { text: "主動表達對他人的關心，帶動正面氛圍，讓每個人在當中感受到溫暖", value: "Fe" },
            { text: "建立一套有效的規則或系統，並合理分配資源，讓每個人都能在當中獲益", value: "Te" }
        ]
    }
];

questionsDataTiFi = [
    {
        id: 1,
        text: "判斷事物是否是「對的」，你更常在乎的是...",
        options: [
            { text: "事物是否符合我的信念或價值觀", value: "Fi" },
            { text: "事物是否在邏輯上是合理的", value: "Ti" }
        ]
    },
    {
        id: 2,
        text: "你看待事物時更像是用...",
        options: [
            { text: "不帶情感色彩的旁觀者視角。這不意味著你冷漠，而是你重視客觀分析，追求清晰且無偏見的理解。", value: "Ti" },
            { text: "追隨內心的主觀視角。這不意味著你自我中心，而是你有自己的原則和判斷方式，而且不會輕易打破自己的原則。", value: "Fi" }
        ]
    },
    {
        id: 3,
        text: "哪一個更像你？",
        options: [
            { text: "總想搞清楚事物的運作方式，拆解其底層邏輯，反覆思考推敲", value: "Ti" },
            { text: "總會回顧自己的內心感受，發掘自己的內心世界", value: "Fi" }
        ]
    },
    {
        id: 4,
        text: "當你與人交流，對於他人所表達的內容，你通常更敏感於...",
        options: [
            { text: "資訊是否精確，以及是否能找到合理的論證和解釋", value: "Ti" },
            { text: "別人是否真誠，若別人看起來虛假或不真誠，你會不信任", value: "Fi" }
        ]
    },
    {
        id: 5,
        text: "哪一個更像你？",
        options: [
            { text: "對於自己的情感狀況與動機相當敏感", value: "Fi" },
            { text: "對於不合邏輯的事物極為敏感，常能察覺到邏輯不嚴謹之處", value: "Ti" }
        ]
    },
    {
        id: 6,
        text: "你更常在乎...",
        options: [
            { text: "對事物的理解，是否完全掌握其架構和原理", value: "Ti" },
            { text: "堅持做真實的自己，忠於內心的感受和價值觀", value: "Fi" }
        ]
    },
    {
        id: 7,
        text: "你更喜歡關注...",
        options: [
            { text: "人們有溫度的情感", value: "Fi" },
            { text: "能客觀分析的邏輯", value: "Ti" }
        ]
    }
];

questionsDataNeSe = [
    {
        id: 1,
        text: "你更喜歡探索什麼？",
        options: [
            { text: "抽象的想法、模式以及事物之間的連結。「事物」可以是任何東西，從技術數據點到人們的感受。", value: "Ne" },
            { text: "身體感覺，以及透過感官體驗周圍的有形世界。這可以是任何事情，從徒步穿越風雨，到關注服裝潮流或品嚐美味佳餚。", value: "Se" }
        ]
    },
    {
        id: 2,
        text: "哪一個更像你？",
        options: [
            { text: "我的思維比較發散，常常跳脫當前的情境，產生許多聯想或新想法", value: "Ne" },
            { text: "我是個活在當下的人，當前實實在在的體驗對我來說最重要", value: "Se" }
        ]
    },
    {
        id: 3,
        text: "哪一個更像你？",
        options: [
            { text: "我喜歡追求直接的感官刺激和體驗，包括視聽體驗、品味美食、體育運動等，身體或感官的刺激會讓我精神振奮", value: "Se" },
            { text: "我喜歡追求新奇的事物，新概念、新事物常引起我的好奇心和探索欲，讓我興致勃勃的主動追求", value: "Ne" }
        ]
    },
    {
        id: 4,
        text: "哪一個更像你？",
        options: [
            { text: "我的觀察力敏銳，會注意到周圍發生的具體事物，可能是景象、氣味、人的行為...等，包含許多容易被忽略的細節，例如人們在互動中的非語言暗示。", value: "Se" },
            { text: "我的想像力豐富，常常被新奇的事物或概念激發新想法，或從一個想法聯想到多種可能性，並發現不同事物之間被人忽略的關聯。", value: "Ne" }
        ]
    },
    {
        id: 5,
        text: "哪一個更像你？",
        options: [
            { text: "我樂於捕捉事物的細節亮點，常能察覺到事物的細節變化", value: "Se" },
            { text: "我更關注事物的整體是什麼，以及它與其他事物的關聯", value: "Ne" }
        ]
    },
    {
        id: 6,
        text: "哪一個更像你？",
        options: [
            { text: "學習新事物時，我喜歡在腦中思考不同角度，從各方面去理解", value: "Ne" },
            { text: "我喜歡親身體驗或親自動手操作，從中認識事物並獲得樂趣", value: "Se" }
        ]
    },
    {
        id: 7,
        text: "哪一個更像你？",
        options: [
            { text: "我喜歡探索可能性，想像未來可能發生的事情，並對變化和不確定性感到興奮", value: "Ne" },
            { text: "比起想像未來的可能性，我更喜歡當下即興發揮，邊行動邊調整", value: "Se" }
        ]
    }
];

questionsDataNiSi = [
    {
        id: 1,
        text: "你通常更想知道...",
        options: [
            { text: "幕後真正發生的事情。你常想「這一切究竟意味著什麼？」，試圖找到其他人錯過的隱藏見解。", value: "Ni" },
            { text: "先前已經證明有效的方法，或值得信賴的人推薦的方法。你在乎什麼是安全、舒適、可重複的。", value: "Si" }
        ]
    },
    {
        id: 2,
        text: "哪一個更像你？",
        options: [
            { text: "我擅長洞察事物的本質，形成對事物的整體印象，將事物以整體印象記在腦中。", value: "Ni" },
            { text: "我擅長記得當下所重視的細節，未來回憶時，這些細節能清晰的想起來。", value: "Si" }
        ]
    },
    {
        id: 3,
        text: "當你接收到新資訊時...",
        options: [
            { text: "你會透過先前的知識和經驗來過濾新資訊，檢查是否符合過去所學習的", value: "Si" },
            { text: "你會把新資訊與內心的預期進行整體性的比對，並高度選擇性的接收", value: "Ni" }
        ]
    },
    {
        id: 4,
        text: "哪一個更像你？",
        options: [
            { text: "你常覺得，想法在你腦中盤旋了一段時間後，你突然頓悟了事情的關鍵之處", value: "Ni" },
            { text: "你非常了解自己內在的身體感覺，若身體某處的感覺與過去不同，你會敏銳地察覺", value: "Si" }
        ]
    },
    {
        id: 5,
        text: "哪一個更像你？",
        options: [
            { text: "我容易注意到事物的細節變化，發現其與過去不同的地方", value: "Si" },
            { text: "我時常對未來有清晰預感或願景，或預見未來趨勢", value: "Ni" }
        ]
    },
    {
        id: 6,
        text: "哪一個更像你？",
        options: [
            { text: "我喜歡將重點放在一些好的想法上，並排除其他想法，以避免分心。你希望直擊問題的核心，忽略所有無關緊要的訊息。", value: "Ni" },
            { text: "我習慣以較為保守的視角看待事物，通常更願意相信經過時間檢驗的觀念。例如既定的規範、慣例或價值。", value: "Si" }
        ]
    },
    {
        id: 7,
        text: "哪一個更像你？",
        options: [
            { text: "我習慣用重複訓練的方式來學習新事物，喜歡安穩的生活節奏和熟悉的日程安排，不喜歡太突然的變化。", value: "Si" },
            { text: "我專注於自己的目標或夢想，並不斷向內尋找實現未來的想法。我會一遍又一遍地重複相同的想法，對其進行磨練並從不同的角度考慮它們。", value: "Ni" }
        ]
    }
];

questionsDataTeNiSi = [
    {
        id: 1,
        text: "在工作中，你更傾向...",
        options: [
            { text: "嚴格安排流程，嚴謹到每一個細節。", value: "Si" },
            { text: "在大方向上果斷做出決策或領導他人。", value: "Ni" }
        ]
    },
    {
        id: 2,
        text: "你通常更關注...",
        options: [
            { text: "傳統和過去的經驗，專注於具體和經過驗證的方法，重視穩定性和可預測性。", value: "Si" },
            { text: "未來的可能性和創新，始終尋找新的機會和策略，以實現目標。", value: "Ni" }
        ]
    },
    {
        id: 3,
        text: "你更擅長...",
        options: [
            { text: "嚴謹的執行。使用既定的方法和過去的經驗來解決問題，關注細節來確保任務能徹底和準確完成，沒有任何東西被忽視。", value: "Si" },
            { text: "遠見的策略。制定未來長期計劃和策略來克服障礙，不怕嘗試新方法或非常規解決方案，只要能達成目標。", value: "Ni" }
        ]
    },
    {
        id: 4,
        text: "做決策時，你更傾向...",
        options: [
            { text: "根據過去的經驗和可靠的方法，謹慎做出決策。", value: "Si" },
            { text: "依賴直覺和邏輯分析，自信做出決策。", value: "Ni" }
        ]
    },
    {
        id: 5,
        text: "哪一個更像你？",
        options: [
            { text: "我擅長洞察事物的本質，形成對事物的整體印象，將事物以整體印象記在腦中。", value: "Ni" },
            { text: "我擅長記得當下所重視的細節，未來回憶時，這些細節能清晰的想起來。", value: "Si" }
        ]
    },
    {
        id: 6,
        text: "哪一個更像你？",
        options: [
            { text: "我時常對未來有清晰預感或願景，或預見未來趨勢。", value: "Ni" },
            { text: "我容易注意到事物的細節變化，發現其與過去不同的地方。", value: "Si" }
        ]
    },
    {
        id: 7,
        text: "哪一個更像你？",
        options: [
            { text: "我喜歡將重點放在一些好的想法上，並排除其他想法，以避免分心。你希望直擊問題的核心，忽略所有無關緊要的訊息。", value: "Ni" },
            { text: "我習慣以較為保守的視角看待事物，通常更願意相信經過時間檢驗的觀念。例如既定的規範、慣例或價值。", value: "Si" }
        ]
    }
];

questionsDataFeNiSi = [
    {
        id: 1,
        text: "哪一個更像你？",
        options: [
            { text: "擅長在生活細節方面，主動關心、照顧他人。", value: "Si" },
            { text: "擅長洞察他人的深層需求，渴望在「本質上」幫助他人。", value: "Ni" }
        ]
    },
    {
        id: 2,
        text: "你通常更想知道...",
        options: [
            { text: "幕後真正發生的事情。你常想「這一切究竟意味著什麼？」，試圖找到其他人錯過的隱藏見解。", value: "Ni" },
            { text: "先前已經證明有效的方法，或值得信賴的人推薦的方法。你在乎什麼是安全、舒適、可重複的。", value: "Si" }
        ]
    },
    {
        id: 3,
        text: "當你想幫助一個群體更好，你更擅長...？",
        options: [
            { text: "專注當下，提供一個穩定、和諧、友好的環境，讓每個人都感受到溫暖。", value: "Si" },
            { text: "關注未來，希望創造一個讓每個人都能成長的環境。", value: "Ni" }
        ]
    },
    {
        id: 4,
        text: "你更擅長...？",
        options: [
            { text: "敏感的察覺社交互動中的細節，利用這些細節有效處理人際關係。", value: "Si" },
            { text: "洞察社交互動中的深層動機，引導他人朝有意義的方向發展。", value: "Ni" }
        ]
    },
    {
        id: 5,
        text: "哪一個更像你？",
        options: [
            { text: "我擅長洞察事物的本質，形成對事物的整體印象，將事物以整體印象記在腦中。", value: "Ni" },
            { text: "我擅長記得當下所重視的細節，未來回憶時，這些細節能清晰的想起來。", value: "Si" }
        ]
    },
    {
        id: 6,
        text: "哪一個更像你？",
        options: [
            { text: "我時常對未來有清晰預感或願景，或預見未來趨勢。", value: "Ni" },
            { text: "我容易注意到人事物的細節變化，發現其與過去不同的地方。", value: "Si" }
        ]
    },
    {
        id: 7,
        text: "哪一個更像你？",
        options: [
            { text: "我喜歡將重點放在一些好的想法上，並排除其他想法，以避免分心。你希望直擊問題的核心，忽略所有無關緊要的訊息。", value: "Ni" },
            { text: "我習慣以較為保守的視角看待事物，通常更願意相信經過時間檢驗的觀念。例如既定的規範、慣例或價值。", value: "Si" }
        ]
    }
];

questionsDataTiNeSe = [
    {
        id: 1,
        text: "哪一個更像你？",
        options: [
            { text: "喜歡思考和討論複雜理論，常在這個過程中有創造性的發現。", value: "Ne" },
            { text: "喜歡透過動手操作，來理解事物的運行原理。", value: "Se" }
        ]
    },
    {
        id: 2,
        text: "在解決問題時，你更傾向...",
        options: [
            { text: "喜歡腦力激盪，考慮各種可能性，試圖找到最好的方法，有時會因此猶豫不決。", value: "Ne" },
            { text: "喜歡直接動手，實際面對挑戰，在實作中分析問題，並迅速決策。", value: "Se" }
        ]
    },
    {
        id: 3,
        text: "哪一個更像你？",
        options: [
            { text: "我的思維比較發散，常常跳脫當前的情境，產生許多聯想或新想法。", value: "Ne" },
            { text: "我是個活在當下的人，當前實實在在的體驗對我來說最重要。", value: "Se" }
        ]
    },
    {
        id: 4,
        text: "哪一個更像你？",
        options: [
            { text: "學習新事物時，我喜歡在腦中思考不同角度，從各方面去理解。", value: "Ne" },
            { text: "我喜歡親身體驗或親自動手操作，從中認識事物並獲得樂趣。", value: "Se" }
        ]
    },
    {
        id: 5,
        text: "哪一個更像你？",
        options: [
            { text: "我喜歡探索可能性，想像未來可能發生的事情，並對變化和不確定性感到興奮。", value: "Ne" },
            { text: "比起想像未來的可能性，我更喜歡當下即興發揮，邊行動邊調整。", value: "Se" }
        ]
    },
    {
        id: 6,
        text: "哪一個更像你？",
        options: [
            { text: "我的觀察力敏銳，會注意到周圍發生的具體事物，可能是景象、氣味、人的行為...等，包含許多容易被忽略的細節。", value: "Se" },
            { text: "我的想像力豐富，常常被新奇的事物或概念激發新想法，或從一個想法聯想到多種可能性，並發現不同事物之間被人忽略的關聯。", value: "Ne" }
            
        ]
    },
    {
        id: 7,
        text: "哪一個更像你？",
        options: [
            { text: "我樂於捕捉事物的細節亮點，常能察覺到事物的細節變化。", value: "Se" },
            { text: "我更關注事物的整體是什麼，以及它與其他事物的關聯。", value: "Ne" }
        ]
    }
];

questionsDataFiNeSe = [
    {
        id: 1,
        text: "哪一個更像你？",
        options: [
            { text: "對有興趣的話題會有各種創意想法，對不感興趣的話題則無話可說", value: "Ne" },
            { text: "對周圍環境敏感，容易被環境感染，而感受到強烈的情緒", value: "Se" }
        ]
    },
    {
        id: 2,
        text: "若你要透過創作來表達信念、理想或情感，你更傾向...",
        options: [
            { text: "涉及更多「頭腦風暴」的方式，例如寫作、構思故事人物、設計創意活動、探討哲學問題等。", value: "Ne" },
            { text: "涉及更多「動手操作」的方式，例如繪畫、音樂、手工藝、攝影、舞蹈等。", value: "Se" }
        ]
    },
    {
        id: 3,
        text: "哪一個更像你？",
        options: [
            { text: "我的思維比較發散，常常跳脫當前的情境，產生許多聯想或新想法", value: "Ne" },
            { text: "我是個活在當下的人，當前實實在在的體驗對我來說最重要", value: "Se" }
        ]
    },
    {
        id: 4,
        text: "哪一個更像你？",
        options: [
            { text: "我的觀察力敏銳，會注意到周圍發生的具體事物，可能是景象、氣味、人的行為...等，包含許多容易被忽略的細節，例如人們在互動中的非語言暗示。", value: "Se" },
            { text: "我的想像力豐富，常常被新奇的事物或概念激發新想法，或從一個想法聯想到多種可能性，並發現不同人事物之間被人忽略的關聯。", value: "Ne" }
            
        ]
    },
    {
        id: 5,
        text: "哪一個更像你？",
        options: [
            { text: "我喜歡探索可能性，想像未來可能發生的事情，並對變化和不確定性感到興奮", value: "Ne" },
            { text: "比起想像未來的可能性，我更喜歡當下即興發揮，邊行動邊調整", value: "Se" }
        ]
    },
    {
        id: 6,
        text: "你更喜歡探索什麼？",
        options: [
            { text: "身體感覺，以及透過感官體驗周圍的有形世界。這可以是任何事情，從徒步穿越風雨，到關注服裝潮流或品嚐美味佳餚。", value: "Se" },
            { text: "抽象的想法、模式以及事物之間的連結。「事物」可以是任何東西，從技術數據點到人們的感受。", value: "Ne" }
        ]
    },
    {
        id: 7,
        text: "哪一個更像你？",
        options: [
            { text: "我樂於捕捉人事物的細節亮點，常能察覺到其細節變化", value: "Se" },
            { text: "我更關注人事物的整體是什麼，以及其與其他人事物的關聯", value: "Ne" }
        ]
    }
];

questionsDataNeTiFi = [
    {
        id: 1,
        text: "哪一個更像你？",
        options: [
            { text: "腦中總是有許多新奇的想法，並用邏輯分析來判斷這些想法的可行性。", value: "Ti" },
            { text: "腦中總是有許多新奇的想法，並常覺得只有與我心靈相通的摯友能懂。", value: "Fi" }
        ]
    },
    {
        id: 2,
        text: "哪一個更像你？",
        options: [
            { text: "喜歡挑戰不同觀點，讓自己對複雜問題的理解更清晰", value: "Ti" },
            { text: "重視親密關係，與人的情感聯繫是我重要的靈感來源", value: "Fi" }
        ]
    },
    {
        id: 3,
        text: "判斷事物或想法是否是「對的」，你更常在乎的是...",
        options: [
            { text: "事物是否符合我的信念或價值觀", value: "Fi" },
            { text: "事物是否在邏輯上是合理的", value: "Ti" }
        ]
    },
    {
        id: 4,
        text: "當別人向你表達觀點或資訊，你通常更敏感於...",
        options: [
            { text: "資訊是否精確，以及是否能找到合理的論證和解釋", value: "Ti" },
            { text: "別人是否真誠，若別人看起來虛假或不真誠，你會不信任", value: "Fi" }
        ]
    },
    {
        id: 5,
        text: "你看待事物時更像是用...",
        options: [
            { text: "不帶情感色彩的旁觀者視角。這不意味著你冷漠，而是你重視客觀分析，追求清晰且無偏見的理解。", value: "Ti" },
            { text: "追隨內心的主觀視角。這不意味著你自我中心，而是你有自己的原則和判斷方式，而且不會輕易打破自己的原則。", value: "Fi" }
        ]
    },
    {
        id: 6,
        text: "你更敏感於...",
        options: [
            { text: "自己的情感狀況與動機，並堅持做真實的自己", value: "Fi" },
            { text: "對事物的理解，是否完全掌握其架構和原理", value: "Ti" }
        ]
    },
    {
        id: 7,
        text: "你更喜歡關注...",
        options: [
            { text: "人們有溫度的情感", value: "Fi" },
            { text: "能客觀分析的邏輯", value: "Ti" }
        ]
    }
];

questionsDataSeTiFi = [
    {
        id: 1,
        text: "哪一個更像你？",
        options: [
            { text: "常在具有操作性的娛樂項目（例如：電玩）中，分析技巧並快速提升表現。", value: "Ti" },
            { text: "常在美好的感官享受中，感受到沈醉和感動。", value: "Fi" }
        ]
    },
    {
        id: 2,
        text: "解決問題時，你較傾向...",
        options: [
            { text: "維持和諧與積極的氛圍，重視其對個人的影響", value: "Fi" },
            { text: "尋求實用和即時的解決方案，重視效率和效能", value: "Ti" }
        ]
    },
    {
        id: 3,
        text: "判斷事物是否是「對的」，你更常在乎的是...",
        options: [
            { text: "事物是否符合我的信念或價值觀", value: "Fi" },
            { text: "事物是否在邏輯上是合理的", value: "Ti" }
        ]
    },
    {
        id: 4,
        text: "當別人向你表達資訊，你通常更敏感於...",
        options: [
            { text: "資訊是否精確，以及是否能找到合理的論證和解釋", value: "Ti" },
            { text: "別人是否真誠，若別人看起來虛假或不真誠，你會不信任", value: "Fi" }
        ]
    },
    {
        id: 5,
        text: "你看待事物時更像是用...",
        options: [
            { text: "不帶情感色彩的旁觀者視角。這不意味著你冷漠，而是你重視客觀分析，追求清晰且無偏見的理解。", value: "Ti" },
            { text: "追隨內心的主觀視角。這不意味著你自我中心，而是你有自己的原則和判斷方式，而且不會輕易打破自己的原則。", value: "Fi" }
        ]
    },
    {
        id: 6,
        text: "你更敏感於...",
        options: [
            { text: "自己的情感狀況與動機，並堅持做真實的自己", value: "Fi" },
            { text: "對事物的理解，是否完全掌握其架構和原理", value: "Ti" }
        ]
    },
    {
        id: 7,
        text: "你更喜歡關注...",
        options: [
            { text: "能客觀分析的邏輯", value: "Ti" },
            { text: "人們有溫度的情感", value: "Fi" }
        ]
    }
];

questionsDataNiTeFe = [
    {
        id: 1,
        text: "哪一個更像你？",
        options: [
            { text: "透過洞察事物的本質，來尋找最有效率和最有效的路徑。", value: "Te" },
            { text: "能深層次的洞察他人心靈深處的情感狀態和需求。", value: "Fe" }
        ]
    },
    {
        id: 2,
        text: "在解決人際衝突時，你更傾向...",
        options: [
            { text: "分析問題根源，嘗試找出解決問題的方案", value: "Te" },
            { text: "傾聽每個人的感受，促進相互理解以恢復和諧", value: "Fe" }
        ]
    },
    {
        id: 3,
        text: "你更傾向重視哪一個？",
        options: [
            { text: "群體的和諧與團結。不是為了群體和諧帶來的工作效益，而是因為真正對人們產生深切的同情，並且你不喜歡群體中有人被排斥或忽視。", value: "Fe" },
            { text: "取得成果和成就。這不意味著你冷漠，而是對你來說，取得成果和找到真正解決問題的方案更重要。", value: "Te" }
        ]
    },
    {
        id: 4,
        text: "哪一個是你更有興趣的？",
        options: [
            { text: "接觸他人、理解他人，同理他人的感受", value: "Fe" },
            { text: "設計或優化系統和流程，解決問題", value: "Te" }
        ]
    },
    {
        id: 5,
        text: "當你需要說服別人接受一個想法時，你更傾向...",
        options: [
            { text: "提供數據和邏輯論證，證明想法的實際效益", value: "Te" },
            { text: "找到共同的價值觀，引起他人的共鳴", value: "Fe" }
        ]
    },
    {
        id: 6,
        text: "你更常在乎的是...",
        options: [
            { text: "事物是否具有實用價值", value: "Te" },
            { text: "行為是否符合社會或群體的期望", value: "Fe" }
        ]
    },
    {
        id: 7,
        text: "你更喜歡關注...",
        options: [
            { text: "人們有溫度的情感", value: "Fe" },
            { text: "能客觀分析的邏輯", value: "Te" }
        ]
    }
];

questionsDataSiTeFe = [
    {
        id: 1,
        text: "哪一個更像你？",
        options: [
            { text: "較喜歡流程明確、細節清晰，且有明確目標的任務", value: "Te" },
            { text: "傳統、穩定和看重人情世故的社會，讓我覺得舒適和安心", value: "Fe" }
        ]
    },
    {
        id: 2,
        text: "你更傾向重視哪一個？",
        options: [
            { text: "群體的和諧與團結。不是為了群體和諧帶來的工作效益，而是因為真正對人們產生深切的同情，並且你不喜歡群體中有人被排斥或忽視。", value: "Fe" },
            { text: "取得成果和成就。這不意味著你冷漠，而是對你來說，取得成果和找到真正解決問題的方案更重要。", value: "Te" }
        ]
    },
    {
        id: 3,
        text: "在規劃或決定一件事時，你通常更傾向考慮...",
        options: [
            { text: "他人的感受和需要", value: "Fe" },
            { text: "是否高效達成目標", value: "Te" }
        ]
    },
    {
        id: 4,
        text: "哪一個是你更有興趣的？",
        options: [
            { text: "接觸他人、理解他人，同理他人的感受", value: "Fe" },
            { text: "設計或優化系統和流程，解決問題", value: "Te" }
        ]
    },
    {
        id: 5,
        text: "當你需要說服別人接受一個想法時，你更傾向...",
        options: [
            { text: "提供數據和邏輯論證，證明想法的實際效益", value: "Te" },
            { text: "找到共同的價值觀，引起他人的共鳴", value: "Fe" }
        ]
    },
    {
        id: 6,
        text: "哪一個是你更有興趣的？",
        options: [
            { text: "接觸他人、理解他人，同理他人的感受", value: "Fe" },
            { text: "設計或優化系統和流程，解決問題", value: "Te" }
        ]
    },
    {
        id: 7,
        text: "你更喜歡關注...",
        options: [
            { text: "能客觀分析的邏輯", value: "Te" },
            { text: "人們有溫度的情感", value: "Fe" }
        ]
    }
];


questionsData = questionsData_IEJP;
